In [7]:
import datetime as datetime
import pandas as pd

# Discrete and Continuous Data

In [ ]:
Discrete Data:
    Definition: discrete data are those data which are full number of integer data.
    Example: 3,5,6,8,4,3,2
        
Continuous Data:
    Definition: Continuous data are those which have continuous value or float value 
    Example: 3.56, 5.234432, 76,454358

# Categorical and Numerical Nominal Ordinal Data

In [ ]:
In computer science have two type of number:-
    1) categorical number
    2) numerical number
    
categorical number:-
    Example: pen,pencil,masters, PHD,book,computer etc.
        
        categorical numbers again two type:-
            1) nominal data 
                Definition: When data have no sequence those are called nominal data
            example: book, pen,computer etc
            2) ordinal data
                Definition: When data have sequence those are called ordinal data
            example: B.Sc, Masters, PHD
                
numerical number:-
    Definition: When data are in number those are called numerical data
    Example: 2,4,5,7,3,2,5

In [12]:
today = datetime.datetime.today()
twenty_day = [today-datetime.timedelta(days=x) for x in range(0,20)]
twenty_day= pd.DataFrame(twenty_day)
twenty_day.columns=['day']
twenty_day.head()

                         day
0 2020-05-13 13:42:07.134629
1 2020-05-12 13:42:07.134629
2 2020-05-11 13:42:07.134629
3 2020-05-10 13:42:07.134629
4 2020-05-09 13:42:07.134629

In [16]:
twenty_day['day_name'] = twenty_day['day'].dt.weekday_name
twenty_day.head()

                         day   day_name
0 2020-05-13 13:42:07.134629  Wednesday
1 2020-05-12 13:42:07.134629    Tuesday
2 2020-05-11 13:42:07.134629     Monday
3 2020-05-10 13:42:07.134629     Sunday
4 2020-05-09 13:42:07.134629   Saturday

In [22]:
#using LabelEncoder 
dicti = {'Saturday':1,
        'Sunday':2,
        'Monday':3,
        'Tuesday':4,
        'Wednesday':5,
        'Thursday':6,
        'Friday':7}

In [24]:
twenty_day['number'] = twenty_day['day_name'].map(dicti)
twenty_day.head()

                         day   day_name  number
0 2020-05-13 13:42:07.134629  Wednesday       5
1 2020-05-12 13:42:07.134629    Tuesday       4
2 2020-05-11 13:42:07.134629     Monday       3
3 2020-05-10 13:42:07.134629     Sunday       2
4 2020-05-09 13:42:07.134629   Saturday       1